garyPenhook/PyAvrOCD/svd/avr32sd20.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU</description>
      <baseAddress>0x00800030</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CPU CRCSCAN ERRCTRL_NMI</name>
        <description>No Description.</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>BOD_VLM</name>
        <description>No Description.</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>ERRCTRL_INT</name>
        <description>No Description.</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>CLKCTRL_INT</name>
        <description>No Description.</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>SLPCTRL_INT</name>
        <description>No Description.</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>SWDT_INT</name>
        <description>No Description.</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>NVMCTRL_ERROR</name>
        <description>No Description.</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>RAMCTRL_INT</name>
        <description>No Description.</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>CRCSCAN_INT</name>
        <description>No Description.</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>MVIO_MVIO</name>
        <description>No Description.</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>RTC_CNT</name>
        <description>No Description.</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>RTC_PIT</name>
        <description>No Description.</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>CCL_CCL</name>
        <description>No Description.</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>PORTA_PORT</name>
        <description>No Description.</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>TCA0_OVF</name>
        <description>No Description.</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>TCA0_HUNF</name>
        <description>No Description.</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>TCA0_CMP0</name>
        <description>No Description.</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>TCA0_CMP1</name>
        <description>No Description.</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>TCA0_CMP2</name>
        <description>No Description.</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>TCB0_INT</name>
        <description>No Description.</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>TCB1_INT</name>
        <description>No Description.</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>TCD0_OVF</name>
        <description>No Description.</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>TCD0_TRIG</name>
        <description>No Description.</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TWI0_TWIS</name>
        <description>No Description.</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>TWI0_TWIM</name>
        <description>No Description.</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>SPI0_INT</name>
        <description>No Description.</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>SPI1_INT</name>
        <description>No Description.</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>USART0_RXC</name>
        <description>No Description.</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>USART0_DRE</name>
        <description>No Description.</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>USART0_TXC</name>
        <description>No Description.</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>PORTD_PORT</name>
        <description>No Description.</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>AC0_AC</name>
        <description>No Description.</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>AC1_AC</name>
        <description>No Description.</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>AC2_AC</name>
        <description>No Description.</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>ADC0_ERROR</name>
        <description>No Description.</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>ADC0_RESRDY</name>
        <description>No Description.</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>ADC0_SAMPRDY</name>
        <description>No Description.</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>ADC1_ERROR</name>
        <description>No Description.</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>ADC1_RESRDY</name>
        <description>No Description.</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>ADC1_SAMPRDY</name>
        <description>No Description.</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>ZCD3_ZCD</name>
        <description>No Description.</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>PORTC_PORT</name>
        <description>No Description.</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>USART1_RXC</name>
        <description>No Description.</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>USART1_DRE</name>
        <description>No Description.</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>USART1_TXC</name>
        <description>No Description.</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>PORTF_PORT</name>
        <description>No Description.</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>NVMCTRL_READY</name>
        <description>No Description.</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>TCB2_INT</name>
        <description>No Description.</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>TCB3_INT</name>
        <description>No Description.</description>
        <value>49</value>
      </interrupt>
      <registers>
        <register>
          <name>CCP</name>
          <description>Configuration Change Protection</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCP</name>
              <description>CCP signature</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPM</name>
                  <description>SPM Instruction Protection</description>
                  <value>157</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOREG</name>
                  <description>IO Register Protection</description>
                  <value>216</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPLOCK</name>
              <description>SPLIM Lock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INJPIC</name>
              <description>Inject Parity Error on Instruction Bus Control</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INJPIA</name>
              <description>Inject Parity Error on Instruction Bus Address</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INJPDC</name>
              <description>Inject Parity Error on Data Bus Control</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INJPDA</name>
              <description>Inject Parity Error on Data Bus Address</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INJPDD</name>
              <description>Inject Parity Error on Data Bus Data</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INJCOMP</name>
              <description>Inject Comparator Error</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NMIDIS</name>
              <description>Disable NMI Request</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPC</name>
              <description>Illegal Opcode Error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>Bus Error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIM</name>
              <description>Stack Pointer Limit Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITYD</name>
              <description>Parity Error on Data Bus</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITYI</name>
              <description>Parity Error on Instruction Bus</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP</name>
          <description>Stack Pointer</description>
          <addressOffset>0xD</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SPLIM</name>
          <description>Stack Pointer Limit</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SREG</name>
          <description>Status Register</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C</name>
              <description>Carry Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Z</name>
              <description>Zero Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>N</name>
              <description>Negative Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>V</name>
              <description>Two's Complement Overflow Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>S</name>
              <description>N Exclusive Or V Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H</name>
              <description>Half Carry Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>T</name>
              <description>Transfer Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I</name>
              <description>Global Interrupt Enable Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
