garyPenhook/PyAvrOCD/svd/avr32sd20.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC0</name>
      <description>Digital to Analog Converter</description>
      <baseAddress>0x008006A0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DAC Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEN</name>
              <description>Output Buffer Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>DATA Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitRange>[15:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ERRCTRL</name>
      <description>Error Controller</description>
      <baseAddress>0x00800E40</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x11</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CAUSE</name>
          <description>Reset Cause</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CAUSE</name>
              <description>Reset Cause</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREGFAIL</name>
                  <description>VREG Low/High voltage detect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSERR</name>
                  <description>Bus Error on data bus or parity error on data</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM2</name>
                  <description>Data (RAM) ECC double bit or comparator error</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH2</name>
                  <description>Flash ECC double bit or comparator error</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPC</name>
                  <description>Illegal opcode instruction or parity error on fetched instruction</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLIM</name>
                  <description>Stack Pointer Limit</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM1</name>
                  <description>Data (RAM) ECC single bit error</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH1</name>
                  <description>Flash ECC single bit error</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREGWARN</name>
                  <description>VREG diagnostic enter/exit or other SLPCTRL error</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFD0</name>
                  <description>CFD 0</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFD1</name>
                  <description>CFD 1</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFM0</name>
                  <description>CFM Frequency Error 0</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFM1</name>
                  <description>CFM Frequency Error 1</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDT</name>
                  <description>SWDT Error</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM</name>
                  <description>EEPROM ECC error</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVSYS0</name>
                  <description>Event system input 0</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVSYS1</name>
                  <description>Event system input 1</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>ERRCTRL State</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFIG</name>
                  <description>Configuration state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal state</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM</name>
                  <description>Alarm state</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>Fault state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTTYPE</name>
              <description>ALARM State Interrupt Type</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMI</name>
                  <description>Non-maskable interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HEART</name>
              <description>Heartbeat Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEFLOAT</name>
              <description>Force I/O Float</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCBUSERR</name>
          <description>Error Source Control BUSERR</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCCFD0</name>
          <description>Error Source Control CFD0</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCCFD1</name>
          <description>Error Source Control CFD1</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCCFM0</name>
          <description>Error Source Control CFM0</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCCFM1</name>
          <description>Error Source Control CFM1</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCEEPROM</name>
          <description>Error Source Control EEPROM</description>
          <addressOffset>0x1E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCEVSYS0</name>
          <description>Error Source Control EVSYS0</description>
          <addressOffset>0x1F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCEVSYS1</name>
          <description>Error Source Control EVSYS1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCFLASH1</name>
          <description>Error Source Control FLASH1</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
