garyPenhook/PyAvrOCD/svd/avr32sd20.svd
        <register>
          <name>STATUSA</name>
          <description>Status A</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NOTIFICATION</name>
              <description>Notification Error Detected</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>There are no Notification errors in the system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>There are one or more Notification errors in the system</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NONCRITICAL</name>
              <description>Noncritical Error Detected</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>There are no Noncritical errors in the system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>There are one or more Noncritical errors in the system</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRITICAL</name>
              <description>Critical Error Detected</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>There are no Critical errors in the system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>There are one or more Critical errors in the system</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOSAFE</name>
              <description>All I/O pins are in safe state</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSAFE</name>
                  <description>One or more I/O pins are not in safe state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAFE</name>
                  <description>All I/O pins are in a safe state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>I/O pins are not forced to floating state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLOAT</name>
                  <description>I/O pins are forced to floating state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMECNT</name>
          <description>Timeout Counter</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TIMECNT</name>
              <description>Timeout Counter Value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT</name>
          <description>Timeout Value</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout Value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
