garyPenhook/PyAvrOCD/svd/avr32sd20.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>Real-Time Counter</description>
      <baseAddress>0x00800140</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLKSEL</name>
          <description>Clock Select</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC32K</name>
                  <description>32.768 kHz from OSC32K</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC1K</name>
                  <description>1.024 kHz from OSC32K</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL32K</name>
                  <description>32.768 kHz from XOSC32K or external clock from XTAL32K1 pin</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>External clock from XOSCHF or external clock from the XTALHF1 pin</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP</name>
          <description>Compare</description>
          <addressOffset>0xC</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CNT</name>
          <description>Counter</description>
          <addressOffset>0x8</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RTCEN</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>Prescaling Factor</description>
              <bitRange>[6:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>RTC Clock / 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>RTC Clock / 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>RTC Clock / 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>RTC Clock / 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>RTC Clock / 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>RTC Clock / 32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>RTC Clock / 64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>RTC Clock / 128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>RTC Clock / 256</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>RTC Clock / 512</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>RTC Clock / 1024</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2048</name>
                  <description>RTC Clock / 2048</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4096</name>
                  <description>RTC Clock / 4096</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8192</name>
                  <description>RTC Clock / 8192</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16384</name>
                  <description>RTC Clock / 16384</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32768</name>
                  <description>RTC Clock / 32768</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run In Standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug control</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Run in debug</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP</name>
              <description>Compare Match Interrupt enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP</name>
              <description>Compare Match Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PER</name>
          <description>Period</description>
          <addressOffset>0xA</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PITCTRLA</name>
          <description>PIT Control A</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PITEN</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIOD</name>
              <description>Period</description>
              <bitRange>[6:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC4</name>
                  <description>RTC Clock Cycles 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC8</name>
                  <description>RTC Clock Cycles 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC16</name>
                  <description>RTC Clock Cycles 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC32</name>
                  <description>RTC Clock Cycles 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC64</name>
                  <description>RTC Clock Cycles 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC128</name>
                  <description>RTC Clock Cycles 128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC256</name>
                  <description>RTC Clock Cycles 256</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC512</name>
                  <description>RTC Clock Cycles 512</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC1024</name>
                  <description>RTC Clock Cycles 1024</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC2048</name>
                  <description>RTC Clock Cycles 2048</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC4096</name>
                  <description>RTC Clock Cycles 4096</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC8192</name>
                  <description>RTC Clock Cycles 8192</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC16384</name>
                  <description>RTC Clock Cycles 16384</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC32768</name>
                  <description>RTC Clock Cycles 32768</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PITDBGCTRL</name>
          <description>PIT Debug control</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Run in debug</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PITEVGENCTRLA</name>
          <description>PIT Event Generation Control A</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVGEN0SEL</name>
              <description>Event Generation 0 Select</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No Event Generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>CLK_RTC divided by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>CLK_RTC divided by 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>CLK_RTC divided by 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>CLK_RTC divided by 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>CLK_RTC divided by 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>CLK_RTC divided by 128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>CLK_RTC divided by 256</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>CLK_RTC divided by 512</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>CLK_RTC divided by 1024</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2048</name>
                  <description>CLK_RTC divided by 2048</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4096</name>
                  <description>CLK_RTC divided by 4096</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8192</name>
                  <description>CLK_RTC divided by 8192</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16384</name>
                  <description>CLK_RTC divided by 16384</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32768</name>
                  <description>CLK_RTC divided by 32768</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVGEN1SEL</name>
              <description>Event Generation 1 Select</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No Event Generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>CLK_RTC divided by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>CLK_RTC divided by 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>CLK_RTC divided by 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>CLK_RTC divided by 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>CLK_RTC divided by 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>CLK_RTC divided by 128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>CLK_RTC divided by 256</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>CLK_RTC divided by 512</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>CLK_RTC divided by 1024</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2048</name>
                  <description>CLK_RTC divided by 2048</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4096</name>
                  <description>CLK_RTC divided by 4096</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8192</name>
                  <description>CLK_RTC divided by 8192</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16384</name>
                  <description>CLK_RTC divided by 16384</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32768</name>
                  <description>CLK_RTC divided by 32768</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PITINTCTRL</name>
          <description>PIT Interrupt Control</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PI</name>
              <description>Periodic Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PITINTFLAGS</name>
          <description>PIT Interrupt Flags</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PI</name>
              <description>Periodic Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PITSTATUS</name>
          <description>PIT Status</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CTRLBUSY</name>
              <description>CTRLA Synchronization Busy Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
